{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":40,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true,"batch_input_shape":[null,1024],"dtype":"float32"}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true}}],"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./digit-NN.weights.bin"],"weights":[{"name":"dense_Dense7/kernel","shape":[1024,40],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[40],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[40,10],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[10],"dtype":"float32"}]}]}